README.org
#+TAGS: noexport(n)
#+OPTIONS: toc:3 \n:t ^:nil creator:nil d:nil
#+AUTHOR: dennyzhang.com (contact@dennyzhang.com)
#+SEQ_TODO: TODO HALF ASSIGN | DONE BYPASS DELEGATE CANCELED DEFERRED
* Do a better technical selling as a developer
*Follow Denny*: in [[https://www.linkedin.com/in/dennyzhang001][LinkedIn]], [[https://github.com/DennyZhang][Github]] or [[https://www.dennyzhang.com][Blog]].

Github Repo: https://github.com/DennyZhang/developer-technical-selling
- For missing points: File me [tickets](https://github.com/DennyZhang/developer-technical-selling/issues)

Similar Projects: 
- Github: [[https://github.com/DennyZhang/developer-technical-selling][Do a better technical selling as a developer]]
- Github: [[https://github.com/DennyZhang/linkedin-grow-influence][How To Improve Professional Influence In Linkedin]]
- Github: [[https://github.com/DennyZhang/maintain-github-repos][Maintain Github Projects For Bigger Influence]]

--------------------------------------------------------
** Principle
*** Don't sell products I personaly have no faith
- Advertising is only evil when it advertises evil things
*** Build trust and frienship first, before trying to sell
*** Show, don’t tell.
*** Remarkability is the key. Nobody can or should sell garbage
** Concepts
*** Social Currency
- Early adopters have social currency
- We share things that make us look good
*** Public Visibility
- If something is built to show, it's built to grow.
- Social proof
- Social influence was stronger when behavior was more observable
- Public visibility boosts word of mouth
- If you want to get people not to do something, don't tell them that lots of their peers are doing it.
- If something is built to show, it's built to grow
*** Practical values 
- Passing along useful things also strengthens social bonds.
- Whether it seems like a fair price or not depends on your expectations 
*** Trigger
- So by linking Kit Kat to coffee, Colleen created a frequent trigger to remind people of the brand.
- Mars bars and Mars the planet are already naturally connected 
- French music is a natural trigger for French wine
- The last day of the workweek is a natural trigger for Rebecca Black's song "Friday"
- Holidays are made for Michelob. is ineffective to. Weekends are made for Michelob.
- Triggers are the foundation of word of mouth and contagiousness.
- Social currency gets people talking. But triggers keep them talking. 
- Top of mind means tip of tongue
** Lesson learned
*** Be very careful with self-promotion activities
Don't post your links everywhere. **Stop it now!**

It won't work. And it will hurt your image. Make your products looks crappy.
** Routine tasks
** Different forms of technical selling
*** Each blog post is a product: journalism + advertising
