README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Do a better technical selling as a developer</a>
<ul>
<li><a href="#sec-1-1">1.1. Principle</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Don't sell products I personaly have no faith</a></li>
<li><a href="#sec-1-1-2">1.1.2. Build trust and frienship first, before trying to sell</a></li>
<li><a href="#sec-1-1-3">1.1.3. Show, don’t tell.</a></li>
<li><a href="#sec-1-1-4">1.1.4. Remarkability is the key. Nobody can or should sell garbage</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Concepts</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Social Currency</a></li>
<li><a href="#sec-1-2-2">1.2.2. Public Visibility</a></li>
<li><a href="#sec-1-2-3">1.2.3. Practical values</a></li>
<li><a href="#sec-1-2-4">1.2.4. Trigger</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Lesson learned</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Be very careful with self-promotion activities</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Routine tasks</a></li>
<li><a href="#sec-1-5">1.5. Different forms of technical selling</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. Each blog post is a product: journalism + advertising</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


# Do a better technical selling as a developer<a id="sec-1" name="sec-1">[]</a>

**Follow Denny**: in [LinkedIn](https://www.linkedin.com/in/dennyzhang001), [Github](https://github.com/DennyZhang) or [Blog](https://www.dennyzhang.com).  

Github Repo: <https://github.com/DennyZhang/developer-technical-selling>  

-   For missing points: File me [tickets](<https://github.com/DennyZhang/developer-technical-selling/issues>)

Similar Projects:  

-   Github: [Do a better technical selling as a developer](https://github.com/DennyZhang/developer-technical-selling)
-   Github: [How To Improve Professional Influence In Linkedin](https://github.com/DennyZhang/linkedin-grow-influence)
-   Github: [Maintain Github Projects For Bigger Influence](https://github.com/DennyZhang/maintain-github-repos)

---

## Principle<a id="sec-1-1" name="sec-1-1">[]</a>

### Don't sell products I personaly have no faith<a id="sec-1-1-1" name="sec-1-1-1">[]</a>

-   Advertising is only evil when it advertises evil things

### Build trust and frienship first, before trying to sell<a id="sec-1-1-2" name="sec-1-1-2">[]</a>

### Show, don’t tell.<a id="sec-1-1-3" name="sec-1-1-3">[]</a>

### Remarkability is the key. Nobody can or should sell garbage<a id="sec-1-1-4" name="sec-1-1-4">[]</a>

## Concepts<a id="sec-1-2" name="sec-1-2">[]</a>

### Social Currency<a id="sec-1-2-1" name="sec-1-2-1">[]</a>

-   Early adopters have social currency
-   We share things that make us look good

### Public Visibility<a id="sec-1-2-2" name="sec-1-2-2">[]</a>

-   If something is built to show, it's built to grow.
-   Social proof
-   Social influence was stronger when behavior was more observable
-   Public visibility boosts word of mouth
-   If you want to get people not to do something, don't tell them that lots of their peers are doing it.
-   If something is built to show, it's built to grow

### Practical values<a id="sec-1-2-3" name="sec-1-2-3">[]</a>

-   Passing along useful things also strengthens social bonds.
-   Whether it seems like a fair price or not depends on your expectations

### Trigger<a id="sec-1-2-4" name="sec-1-2-4">[]</a>

-   So by linking Kit Kat to coffee, Colleen created a frequent trigger to remind people of the brand.
-   Mars bars and Mars the planet are already naturally connected
-   French music is a natural trigger for French wine
-   The last day of the workweek is a natural trigger for Rebecca Black's song "Friday"
-   Holidays are made for Michelob. is ineffective to. Weekends are made for Michelob.
-   Triggers are the foundation of word of mouth and contagiousness.
-   Social currency gets people talking. But triggers keep them talking.
-   Top of mind means tip of tongue

## Lesson learned<a id="sec-1-3" name="sec-1-3">[]</a>

### Be very careful with self-promotion activities<a id="sec-1-3-1" name="sec-1-3-1">[]</a>

Don't post your links everywhere. ****Stop it now!****  

It won't work. And it will hurt your image. Make your products looks crappy.  

## Routine tasks<a id="sec-1-4" name="sec-1-4">[]</a>

## Different forms of technical selling<a id="sec-1-5" name="sec-1-5">[]</a>

### Each blog post is a product: journalism + advertising<a id="sec-1-5-1" name="sec-1-5-1">[]</a>